Return-Path: <linux-kernel+bounces-286887-lists+linux-kernel=lfdr.de@vger.kernel.org>
X-Original-To: lists+linux-kernel@lfdr.de
Delivered-To: lists+linux-kernel@lfdr.de
Received: from sv.mirrors.kernel.org (sv.mirrors.kernel.org [139.178.88.99])
	by mail.lfdr.de (Postfix) with ESMTPS id 4B4FF952003
	for <lists+linux-kernel@lfdr.de>; Wed, 14 Aug 2024 18:31:21 +0200 (CEST)
Received: from smtp.subspace.kernel.org (wormhole.subspace.kernel.org [52.25.139.140])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by sv.mirrors.kernel.org (Postfix) with ESMTPS id 01C78282DDA
	for <lists+linux-kernel@lfdr.de>; Wed, 14 Aug 2024 16:31:20 +0000 (UTC)
Received: from localhost.localdomain (localhost.localdomain [127.0.0.1])
	by smtp.subspace.kernel.org (Postfix) with ESMTP id 1B1781B3F3E;
	Wed, 14 Aug 2024 16:31:16 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org;
	dkim=pass (2048-bit key) header.d=qualcomm.com header.i=@qualcomm.com header.b="Ff7/j9lV"
Received: from mx0a-0031df01.pphosted.com (mx0a-0031df01.pphosted.com [205.220.168.131])
	(using TLSv1.2 with cipher ECDHE-RSA-AES256-GCM-SHA384 (256/256 bits))
	(No client certificate requested)
	by smtp.subspace.kernel.org (Postfix) with ESMTPS id C91F93A28D;
	Wed, 14 Aug 2024 16:31:11 +0000 (UTC)
Authentication-Results: smtp.subspace.kernel.org; arc=fail smtp.client-ip=205.220.168.131
ARC-Seal:i=2; a=rsa-sha256; d=subspace.kernel.org; s=arc-20240116;

X-Proofpoint-GUID: MFw53F7Uw4WhtcU7nsBQzR-GPV1HyaO_
X-Proofpoint-Virus-Version: vendor=baseguard
 engine=ICAP:2.0.293,Aquarius:18.0.1039,Hydra:6.0.680,FMLib:17.12.28.16
 definitions=2024-08-14_12,2024-08-13_02,2024-05-17_01
X-Proofpoint-Spam-Details: rule=outbound_notspam policy=outbound score=0 adultscore=0 mlxscore=0
 impostorscore=0 lowpriorityscore=0 mlxlogscore=999 clxscore=1011
 phishscore=0 priorityscore=1501 suspectscore=0 spamscore=0 malwarescore=0
 bulkscore=0 classifier=spam adjust=0 reason=mlx scancount=1
 engine=8.19.0-2407110000 definitions=main-2408140113

Hello Brian, et.al

This is not related to clang-20.

The compiler is asserting because the expression is not considering the ali=
gnment
of the 'attrs' member.  This can be seen in the output when -fdump-record-l=
ayouts=20
is added the compiler (and the assert commented out).  The union in=20
question is:

struct uverbs_attr_bundle {
   union { <union entries including uverbs_attr_bundle_hdr> }
   struct uverbs_attr attrs[];
};

Static_assert(
   __builtin_offsetof(struct uverbs_attr_bundle, attrs) =3D=3D sizeof(struc=
t uverbs_attr_bundle_hdr),=20
   "struct member likely outside of struct_group_tagged()")
note: expression evaluates to '56 =3D=3D 52'

Regards,

Steve Walk


Evidence below.

28127 *** Dumping AST Record Layout
28128          0 | struct uverbs_attr_bundle
28129          0 |   union uverbs_attr_bundle::(anonymous at noAssert.c:941=
78:2)
28130          0 |     struct uverbs_attr_bundle::(anonymous at noAssert.c:=
94178:10)
28131          0 |       struct ib_udata driver_udata
28132          0 |         const void * inbuf
28133          4 |         void * outbuf
28134          8 |         size_t inlen
28135         12 |         size_t outlen
28136         16 |       struct ib_udata ucore
28137         16 |         const void * inbuf
28138         20 |         void * outbuf
28139         24 |         size_t inlen
28140         28 |         size_t outlen
28141         32 |       struct ib_uverbs_file * ufile
28142         36 |       struct ib_ucontext * context
28143         40 |       struct ib_uobject * uobject
28144         44 |       unsigned long[2] attr_present
28145          0 |     struct uverbs_attr_bundle_hdr hdr=20
28146          0 |       struct ib_udata driver_udata
28147          0 |         const void * inbuf
28148          4 |         void * outbuf
28149          8 |         size_t inlen
28150         12 |         size_t outlen
28151         16 |       struct ib_udata ucore
28152         16 |         const void * inbuf
28153         20 |         void * outbuf
28154         24 |         size_t inlen
28155         28 |         size_t outlen
28156         32 |       struct ib_uverbs_file * ufile
28157         36 |       struct ib_ucontext * context
28158         40 |       struct ib_uobject * uobject
28159         44 |       unsigned long[2] attr_present
28160         56 |   struct uverbs_attr[] attrs //<<--- Field used in _Stat=
ic_assert
28161            | [sizeof=3D56, align=3D8]
28162

28022 *** Dumping AST Record Layout
28023          0 | union uverbs_attr::(anonymous at noAssert.c:94169:2)
28024          0 |   struct uverbs_ptr_attr ptr_attr
28025          0 |     union uverbs_ptr_attr::(anonymous at noAssert.c:9414=
9:2)
28026          0 |       void * ptr
28027          0 |       u64 data
28028          8 |     u16 len
28029         10 |     u16 uattr_idx
28030         12 |     u8 enum_id
28031          0 |   struct uverbs_obj_attr obj_attr
28032          0 |     struct ib_uobject * uobject
28033          4 |     const struct uverbs_api_attr * attr_elm
28034          0 |   struct uverbs_objs_arr_attr objs_arr_attr
28035          0 |     struct ib_uobject ** uobjects
28036          4 |     u16 len
28037            | [sizeof=3D16, align=3D8] //<<--- Required alignment
28038

This record is in the union that cries.

28093 *** Dumping AST Record Layout
28094          0 | union uverbs_attr_bundle::(anonymous at noAssert.c:94178=
:2)
28095          0 |   struct uverbs_attr_bundle::(anonymous at noAssert.c:94=
178:10)
28096          0 |     struct ib_udata driver_udata
28097          0 |       const void * inbuf
28098          4 |       void * outbuf
28099          8 |       size_t inlen
28100         12 |       size_t outlen
28101         16 |     struct ib_udata ucore
28102         16 |       const void * inbuf
28103         20 |       void * outbuf
28104         24 |       size_t inlen
28105         28 |       size_t outlen
28106         32 |     struct ib_uverbs_file * ufile
28107         36 |     struct ib_ucontext * context
28108         40 |     struct ib_uobject * uobject
28109         44 |     unsigned long[2] attr_present
28110          0 |   struct uverbs_attr_bundle_hdr hdr
28111          0 |     struct ib_udata driver_udata
28112          0 |       const void * inbuf
28113          4 |       void * outbuf
28114          8 |       size_t inlen
28115         12 |       size_t outlen
28116         16 |     struct ib_udata ucore
28117         16 |       const void * inbuf
28118         20 |       void * outbuf
28119         24 |       size_t inlen
28120         28 |       size_t outlen
28121         32 |     struct ib_uverbs_file * ufile
28122         36 |     struct ib_ucontext * context
28123         40 |     struct ib_uobject * uobject
28124         44 |     unsigned long[2] attr_present
28125            | [sizeof=3D52, align=3D4]
28126

-----Original Message-----
From: Brian Cain <bcain@quicinc.com>=20
Sent: Tuesday, August 13, 2024 10:27 PM
To: Brian Cain <bcain@quicinc.com>; Nathan Chancellor <nathan@kernel.org>; =
Gustavo A. R. Silva <gustavo@embeddedor.com>; Steven Walk (QUIC) <quic_walk=
@quicinc.com>
Cc: kernel test robot <lkp@intel.com>; Gustavo A. R. Silva <gustavoars@kern=
el.org>; llvm@lists.linux.dev; oe-kbuild-all@lists.linux.dev; LKML <linux-k=
ernel@vger.kernel.org>; linux-hexagon@vger.kernel.org; Sid Manning <sidneym=
@quicinc.com>; Sundeep Kushwaha <sundeepk@quicinc.com>
Subject: RE: [gustavoars:testing/wfamnae-next20240729-cbc-2 11/18] include/=
rdma/uverbs_ioctl.h:643:15: error: static assertion failed due to requireme=
nt '__builtin_offsetof(struct uverbs_attr_bundle, attrs) =3D=3D sizeof(stru=
ct uverbs_attr_bundle_hdr)': struct memb...



> -----Original Message-----
> From: Brian Cain <bcain@quicinc.com>
> Sent: Tuesday, August 6, 2024 10:36 AM
> To: Nathan Chancellor <nathan@kernel.org>; Gustavo A. R. Silva=20
> <gustavo@embeddedor.com>
> Cc: kernel test robot <lkp@intel.com>; Gustavo A. R. Silva=20
> <gustavoars@kernel.org>; llvm@lists.linux.dev;=20
> oe-kbuild-all@lists.linux.dev; LKML <linux-kernel@vger.kernel.org>;=20
> linux-hexagon@vger.kernel.org; Sid Manning <sidneym@quicinc.com>;=20
> Sundeep Kushwaha <sundeepk@quicinc.com>
> Subject: RE: [gustavoars:testing/wfamnae-next20240729-cbc-2 11/18]
> include/rdma/uverbs_ioctl.h:643:15: error: static assertion failed due=20
> to requirement '__builtin_offsetof(struct uverbs_attr_bundle, attrs)=20
> =3D=3D sizeof(struct uverbs_attr_bundle_hdr)': struct memb...
>=20
> WARNING: This email originated from outside of Qualcomm. Please be=20
> wary of any links or attachments, and do not enable macros.
>=20
> > -----Original Message-----
> > From: Nathan Chancellor <nathan@kernel.org>
> > Sent: Friday, August 2, 2024 5:20 PM
> > To: Gustavo A. R. Silva <gustavo@embeddedor.com>
> > Cc: kernel test robot <lkp@intel.com>; Gustavo A. R. Silva=20
> > <gustavoars@kernel.org>; llvm@lists.linux.dev;=20
> > oe-kbuild-all@lists.linux.dev; LKML <linux-kernel@vger.kernel.org>;=20
> > Brian Cain <bcain@quicinc.com>; linux- hexagon@vger.kernel.org
> > Subject: Re: [gustavoars:testing/wfamnae-next20240729-cbc-2 11/18]
> > include/rdma/uverbs_ioctl.h:643:15: error: static assertion failed=20
> > due to requirement '__builtin_offsetof(struct uverbs_attr_bundle,=20
> > attrs) =3D=3D sizeof(struct uverbs_attr_bundle_hdr)': struct memb...
> >
> > WARNING: This email originated from outside of Qualcomm. Please be=20
> > wary
> of
> > any links or attachments, and do not enable macros.
> >
> > On Thu, Aug 01, 2024 at 04:35:59PM -0600, Gustavo A. R. Silva wrote:
> > >
> > >
> > > On 01/08/24 16:14, Nathan Chancellor wrote:
> > > > On Thu, Aug 01, 2024 at 02:17:50PM -0600, Gustavo A. R. Silva wrote=
:
> > > > >
> > > > >
> > > > > On 01/08/24 13:08, Nathan Chancellor wrote:
> > > > > > On Thu, Aug 01, 2024 at 06:47:58AM -0600, Gustavo A. R. Silva w=
rote:
> > > > > > >
> > > > > > >
> > > > > > > On 01/08/24 05:35, kernel test robot wrote:
> > > > > > > > tree:
> > https://git.kernel.org/pub/scm/linux/kernel/git/gustavoars/linux.git
> > testing/wfamnae-next20240729-cbc-2
> > > > > > > > head:   df15c862c1b93b6e1f6c90b0d7971f7a6ad66751
> > > > > > > > commit: e7cd9f429a852fb7e37a706c7d08fc36e7863e06 [11/18]
> > RDMA/uverbs: Use static_assert() to check struct sizes
> > > > > > > > config: hexagon-randconfig-001-20240801
> > (https://download.01.org/0day-
> ci/archive/20240801/202408011956.wscyBwq6-
> > lkp@intel.com/config)
> > > > > > > > compiler: clang version 20.0.0git=20
> > > > > > > > (https://github.com/llvm/llvm-
> > project 430b90f04533b099d788db2668176038be38c53b)
> > > > > > >
> > > > > > >
> > > > > > > Clang 20.0.0?? (thinkingface)
> > > > > >
> > > > > > Indeed, Clang 19 branched and main is now 20 :)
> > > > > >
> > > > > > https://github.com/llvm/llvm-
> > project/commit/8f701b5df0adb3a2960d78ca2ad9cf53f39ba2fe
> > > > >
> > > > > Yeah, but is that a stable release?
> > > >
> > > > No, but the Intel folks have tested tip of tree LLVM against the=20
> > > > kernel for us for a few years now to try and catch issues such as t=
his.
> > >
> > > Oh, I see, fine. :)
> > >
> > > >
> > > > > BTW, I don't see GCC reporting the same problem below:
> > > >
> > > > Hexagon does not have a GCC backend anymore so it is not going=20
> > > > to be possible to do an exact A/B comparison with this configuratio=
n but...
> > > >
> > > > > > > > > > include/rdma/uverbs_ioctl.h:643:15: error: static=20
> > > > > > > > > > assertion
> failed
> > due to requirement '__builtin_offsetof(struct uverbs_attr_bundle,=20
> > attrs) =3D=3D sizeof(struct uverbs_attr_bundle_hdr)': struct member=20
> > likely outside of
> > struct_group_tagged()
> > > > > > > >         643 | static_assert(offsetof(struct=20
> > > > > > > > uverbs_attr_bundle, attrs)
> =3D=3D
> > sizeof(struct uverbs_attr_bundle_hdr),
> > > > > > > >             |
> >
> ~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
> > ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
> > > > > > > >         644 |               "struct member likely outside o=
f
> > struct_group_tagged()");
> > > > > > > >             |
> > ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
> > > > > > > >       include/linux/stddef.h:16:32: note: expanded from=20
> > > > > > > > macro
> > 'offsetof'
> > > > > > > >          16 | #define offsetof(TYPE, MEMBER)
> __builtin_offsetof(TYPE,
> > MEMBER)
> > > > > > > >             |                                 ^
> > > > > > > >       include/linux/build_bug.h:77:50: note: expanded=20
> > > > > > > > from macro
> > 'static_assert'
> > > > > > > >          77 | #define static_assert(expr, ...)=20
> > > > > > > > __static_assert(expr,
> > ##__VA_ARGS__, #expr)
> > > > > > > >             |
> > ~~~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~~~~~~~~~~
> > > > > > > >       include/linux/build_bug.h:78:56: note: expanded=20
> > > > > > > > from macro
> > '__static_assert'
> > > > > > > >          78 | #define __static_assert(expr, msg, ...)=20
> > > > > > > > _Static_assert(expr,
> > msg)
> > > > > > > >             |                                              =
          ^~~~
> > > > > > > >       include/rdma/uverbs_ioctl.h:643:58: note:=20
> > > > > > > > expression evaluates
> > to '56 =3D=3D 52'
> > > >
> > > > This seems to give some indication that perhaps there may be=20
> > > > some architecture specific here with padding maybe? I seem to=20
> > > > recall ARM OABI having something similar. Adding the Hexagon=20
> > > > folks/list to get some more clarification. Full warning and context=
:
> > > >
> > > > https://lore.kernel.org/202408011956.wscyBwq6-lkp@intel.com/
> > > >
>=20
> There might be hexagon-specific padding requirements, but not ones=20
> that I've stumbled across before.  I've added Sundeep from the=20
> compiler team who may be able to help.

Steve suggested I try dumping the record layouts using clang's "-fdump-reco=
rd-layouts".  I did so using the clang 18.1.8 binary from https://github.co=
m/llvm/llvm-project/releases/tag/llvmorg-18.1.8 -- I thought it was reasona=
ble to use this older release because it still generates the static asserti=
on.  But I can repeat it with clang-20 built from the bot's cited commit if=
 preferred.

Steve - can you give any advice about the compiler's behavior wrt this stru=
ct layout and the assertion?

I've attached the unabridged output from clang with "-fdump-record-layouts"=
.  Here's an excerpt:

*** Dumping AST Record Layout
         0 | struct uverbs_attr_bundle_hdr
         0 |   struct ib_udata driver_udata
         0 |     const void * inbuf
         4 |     void * outbuf
         8 |     size_t inlen
        12 |     size_t outlen
        16 |   struct ib_udata ucore
        16 |     const void * inbuf
        20 |     void * outbuf
        24 |     size_t inlen
        28 |     size_t outlen
        32 |   struct ib_uverbs_file * ufile
        36 |   struct ib_ucontext * context
        40 |   struct ib_uobject * uobject
        44 |   unsigned long[2] attr_present
           | [sizeof=3D52, align=3D4]

*** Dumping AST Record Layout
         0 | union uverbs_attr_bundle::(anonymous at ../include/rdma/uverbs=
_ioctl.h:633:2)
         0 |   struct uverbs_attr_bundle::(anonymous at ../include/rdma/uve=
rbs_ioctl.h:633:2)=20
         0 |     struct ib_udata driver_udata
         0 |       const void * inbuf
         4 |       void * outbuf
         8 |       size_t inlen
        12 |       size_t outlen
        16 |     struct ib_udata ucore
        16 |       const void * inbuf
        20 |       void * outbuf
        24 |       size_t inlen
        28 |       size_t outlen
        32 |     struct ib_uverbs_file * ufile
        36 |     struct ib_ucontext * context
        40 |     struct ib_uobject * uobject
        44 |     unsigned long[2] attr_present
         0 |   struct uverbs_attr_bundle_hdr hdr
         0 |     struct ib_udata driver_udata
         0 |       const void * inbuf
         4 |       void * outbuf
         8 |       size_t inlen
        12 |       size_t outlen
        16 |     struct ib_udata ucore
        16 |       const void * inbuf
        20 |       void * outbuf
        24 |       size_t inlen
    In file included from ../drivers/infiniband/core/ib_core_uverbs.c:8:
In file included from ../drivers/infiniband/core/uverbs.h:49:
In file included from ../include/rdma/uverbs_std_types.h:10:
../include/rdma/uverbs_ioctl.h:643:15: error: static assertion failed due t=
o requirement '__builtin_offsetof(struct uverbs_attr_bundle, attrs) =3D=3D =
sizeof(struct uverbs_attr_bundle_hdr)': struct member likely outside of str=
uct_group_tagged()
  643 | static_assert(offsetof(struct uverbs_attr_bundle, attrs) =3D=3D siz=
eof(struct uverbs_attr_bundle_hdr),
      | ~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~=
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  644 |               "struct member likely outside of struct_group_tagged(=
)");
      |               ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~=
~~~
../include/linux/stddef.h:16:32: note: expanded from macro 'offsetof'
   16 | #define offsetof(TYPE, MEMBER)  __builtin_offsetof(TYPE, MEMBER)
      |                                 ^
../include/linux/build_bug.h:77:50: note: expanded from macro 'static_asser=
t'
   77 | #define static_assert(expr, ...) __static_assert(expr, ##__VA_ARGS_=
_, #expr)
      |                                  ~~~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~=
~~~~~~~~~
../include/linux/build_bug.h:78:56: note: expanded from macro '__static_ass=
ert'
   78 | #define __static_assert(expr, msg, ...) _Static_assert(expr, msg)
      |                                                        ^~~~
../include/rdma/uverbs_ioctl.h:643:58: note: expression evaluates to '56 =
=3D=3D 52'
  643 | static_assert(offsetof(struct uverbs_attr_bundle, attrs) =3D=3D siz=
eof(struct uverbs_attr_bundle_hdr),
      | ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~^~~~~~~~~~=
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  644 |               "struct member likely outside of struct_group_tagged(=
)");
      |               ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~=
~~~
../include/linux/build_bug.h:77:50: note: expanded from macro 'static_asser=
t'
   77 | #define static_assert(expr, ...) __static_assert(expr, ##__VA_ARGS_=
_, #expr)
      |                                  ~~~~~~~~~~~~~~~~^~~~~~~~~~~~~~~~~~=
~~~~~~~~~
../include/linux/build_bug.h:78:56: note: expanded from macro '__static_ass=
ert'
   78 | #define __static_assert(expr, msg, ...) _Static_assert(expr, msg)
      |                                                        ^~~~
    28 |       size_t outlen
        32 |     struct ib_uverbs_file * ufile
        36 |     struct ib_ucontext * context
        40 |     struct ib_uobject * uobject
        44 |     unsigned long[2] attr_present
           | [sizeof=3D52, align=3D4]

I've also attached the "clang -cc1" invocation and preprocessed C output fo=
r reference.

> > > > The problematic section preprocessed since sometimes the macros=20
> > > > obfuscate things:
> > > >
> > > > struct uverbs_attr_bundle {
> > > >          union {
> > > >                  struct {
> > > >                          struct ib_udata driver_udata;
> > > >                          struct ib_udata ucore;
> > > >                          struct ib_uverbs_file *ufile;
> > > >                          struct ib_ucontext *context;
> > > >                          struct ib_uobject *uobject;
> > > >                          unsigned long
> attr_present[(((UVERBS_API_ATTR_BKEY_LEN)
> > +
> > > >                                                       ((sizeof(long=
) * 8)) - 1) /
> > > >                                                      ((sizeof(long)=
 * 8)))];
> > > >                  };
> > > >                  struct uverbs_attr_bundle_hdr {
